testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_10000000____delay-ms_0____loss-rate-percent_0____clients-requests_10/8/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 331.69ms, 30.15 req/s, 287.61MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 95.40MB (100031270) total, 120B (120) headers (space savings 87.37%), 95.37MB (100000000) data
UDP datagram: 4091 sent, 82162 received
                     min         max         mean         sd        +/- sd
time for request:   304.42ms    325.51ms    314.53ms      6.97ms    60.00%
time for connect:     4.16ms     26.30ms     15.35ms      7.42ms    60.00%
time to 1st byte:    26.08ms     28.51ms     27.28ms       998us    50.00%
req/s           :       3.02        3.04        3.03        0.01    60.00%